app/controllers/comments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "body", "rating", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 5], ["body", "Only for alpha"], ["rating", 3], ["product_id", 5], ["created_at", "2018-10-24 01:24:51.355314"], ["updated_at", "2018-10-24 01:24:51.355314"]]
---
  def create
    @product = Product.find(params[:product_id])
    @comment = @product.comments.new(comment_params)
    @comment.user = current_user
    @user = current_user

    respond_to do |format|
      if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 14]]
---
  def destroy
    @comment = Comment.find(params[:id])
    product = @comment.product
    @comment.destroy