app/controllers/payments_controller.rb

def create
 # Amount in cents
   @product =  Product.find(params[:product_id])
   @user = current_user

   token  = params[:stripeToken]

   begin
    charge = Stripe::Charge.create(
      amount: @product.price.to_i,
      currency: "cad",
      source: token,
      description: params[:stripeEmail]
    )

    if charge.paid
      Order.create(user_id: current_user.id, product_id: params[:product_id], total: @product.price.to_i)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "product_id", "total") VALUES (?, ?, ?)  [["user_id", 6], ["product_id", 3], ["total", 445045.0]]