app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%3%')
SELECT MAX("products"."updated_at") FROM "products"
---
  def index
    if params[:q]
      search_term = params[:q]
      @products = Product.search(search_term)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."product_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["product_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]
---
  def show
      @product = Product.find(params[:id])

      # @comments = @product.comments.order("created_at DESC")
      # @comments = Comment.paginate(:page => params[:page], :per_page => 5)

      @comments = @product.comments.paginate(:page => params[:page], :per_page => 5).order("created_at DESC")

INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at", "colour") VALUES (?, ?, ?, ?, ?, ?)  [["name", "fff"], ["description", ""], ["image_url", ""], ["created_at", "2018-10-26 01:18:41.614340"], ["updated_at", "2018-10-26 01:18:41.614340"], ["colour", ""]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "name" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Kona Sutra"], ["price", 186195.0], ["updated_at", "2018-11-03 12:33:47.322417"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)